log/log.gpgizeme/exp/benchmark/fio/fio_test/result/fio.20140710_160103.p7n.tgtest_tyRW_qd192_nj192_bs4k.out
p7n.tgtest_tyRW_qd192_nj192_bs4k: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=192
...
fio-2.1.10-2-g3e2e
Starting 192 processes

p7n.tgtest_tyRW_qd192_nj192_bs4k: (groupid=0, jobs=192): err= 0: pid=10511: Thu Jul 10 16:02:33 2014
  write: io=48238MB, bw=822782KB/s, iops=205084, runt= 60035msec
    slat (usec): min=2, max=109421, avg=932.43, stdev=5941.23
    clat (usec): min=10, max=775224, avg=178620.47, stdev=92764.10
     lat (usec): min=28, max=819933, avg=179555.30, stdev=93106.40
    clat percentiles (usec):
     |  1.00th=[ 1528],  5.00th=[33536], 10.00th=[59136], 20.00th=[99840],
     | 30.00th=[126464], 40.00th=[152576], 50.00th=[175104], 60.00th=[197632],
     | 70.00th=[224256], 80.00th=[254976], 90.00th=[301056], 95.00th=[337920],
     | 99.00th=[415744], 99.50th=[444416], 99.90th=[505856], 99.95th=[528384],
     | 99.99th=[593920]
    bw (KB  /s): min=    0, max=13145, per=0.52%, avg=4239.79, stdev=1440.40
    lat (usec) : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.02%
    lat (usec) : 750=0.05%, 1000=0.11%
    lat (msec) : 2=2.07%, 4=1.62%, 10=0.61%, 20=0.07%, 50=4.31%
    lat (msec) : 100=11.21%, 250=58.61%, 500=21.49%, 750=0.12%, 1000=0.01%
  cpu          : usr=0.55%, sys=3.60%, ctx=10175870, majf=0, minf=12150
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=150.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=12312259/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=192

Run status group 0 (all jobs):
  WRITE: io=48238MB, aggrb=822782KB/s, minb=822782KB/s, maxb=822782KB/s, mint=60035msec, maxt=60035msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

Additional Terse Output:
3;fio-2.1.10-2-g3e2e;p7n.tgtest_tyRW_qd192_nj192_bs4k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;49395724;822782;205084;60035;2;109421;932.432940;5941.234420;10;775224;178620.469819;92764.104187;1.000000%=1528;5.000000%=33536;10.000000%=59136;20.000000%=99840;30.000000%=126464;40.000000%=152576;50.000000%=175104;60.000000%=197632;70.000000%=224256;80.000000%=254976;90.000000%=301056;95.000000%=337920;99.000000%=415744;99.500000%=444416;99.900000%=505856;99.950000%=528384;99.990000%=593920;0%=0;0%=0;0%=0;28;819933;179555.298143;93106.400511;0;13145;0.515299%;4239.789688;1440.397278;0.547844%;3.602657%;10175870;0;12150;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;150.1%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.02%;0.05%;0.11%;2.07%;1.62%;0.61%;0.07%;4.31%;11.21%;58.61%;21.49%;0.12%;0.01%;0.00%;0.00%